-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  C:\Users\idank\לימודים\שנה ב\אקונומטריקה\מבחן בית\Final_Exam.log
  log type:  text
 opened on:  19 Feb 2021, 00:54:19

. 
. /* 
> idan keipour 
> 315355537
> Final Exam
> */
. use "ukdata_new", clear
(Written by R)

. 
. //To check which variables contain missing values
. count if educ==-999  
  0

. count if married==-999
  0

. count if bornuk==-999
  0

. count if female==-999
  0

. count if age==-999
  0

. count if wage==-999
  0

. count if year==-999
  0

. count if id==-999
  0

. count if firmsize==-999
  2,946

. replace firmsize=. if firmsize==-999
(2,946 real changes made, 2,946 to missing)

. 
. //question 1
. count if age==50 & female==1 & educ==3
  116

. count if age==50 & female==1
  406

. // the answer is 116/406
. //question 2
. count if age==50 & female==0 & educ==3
  81

. count if age==50 & female==0
  313

. // the answer is 81/313
. 
. //question 3
. /* The calculation is this:
> n1=406
> n2=313
> p1=116/406
> p2=81/313
> all_prop= ((n1)/(n1+n2))*p1+((n2)/(n1+n2))*p2
> denominator=math.sqrt(((all_prop*(1-all_prop))/n1)+((all_prop*(1-all_prop))/n2))
> t=((p1-p2)/denominator)= 0.80267715
> */
. //question 4
. drop if age<20 
(1,092 observations deleted)

. drop if age>65
(471 observations deleted)

. drop if female==0 
(17,439 observations deleted)

. 
. gen lwage=log(wage)

. gen age2=age*age

. gen hsg=1 if educ==2
(16,363 missing values generated)

. replace hsg=0 if educ!=2
(16,363 real changes made)

. //model 1
. reg lwage age educ

      Source |       SS           df       MS      Number of obs   =    20,867
-------------+----------------------------------   F(2, 20864)     =   1631.52
       Model |  1574.75565         2  787.377827   Prob > F        =    0.0000
    Residual |  10069.0432    20,864  .482603683   R-squared       =    0.1352
-------------+----------------------------------   Adj R-squared   =    0.1352
       Total |  11643.7989    20,866   .55802736   Root MSE        =     .6947

------------------------------------------------------------------------------
       lwage |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         age |   .0083563   .0004506    18.54   0.000     .0074731    .0092395
        educ |   .3146667   .0055519    56.68   0.000     .3037845     .325549
       _cons |   6.271987   .0225916   277.62   0.000     6.227706    6.316268
------------------------------------------------------------------------------

. //model 2
. reg lwage age educ age2

      Source |       SS           df       MS      Number of obs   =    20,867
-------------+----------------------------------   F(3, 20863)     =   1262.59
       Model |  1789.15875         3  596.386251   Prob > F        =    0.0000
    Residual |  9854.64015    20,863    .4723501   R-squared       =    0.1537
-------------+----------------------------------   Adj R-squared   =    0.1535
       Total |  11643.7989    20,866   .55802736   Root MSE        =    .68728

------------------------------------------------------------------------------
       lwage |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         age |   .0749633    .003158    23.74   0.000     .0687735    .0811532
        educ |   .3082525   .0055009    56.04   0.000     .2974704    .3190347
        age2 |  -.0008302    .000039   -21.31   0.000    -.0009066   -.0007538
       _cons |   5.051281   .0615014    82.13   0.000     4.930733    5.171828
------------------------------------------------------------------------------

. //model 3 
. reg lwage age educ age2 hsg     

      Source |       SS           df       MS      Number of obs   =    20,867
-------------+----------------------------------   F(4, 20862)     =   1046.85
       Model |  1946.44396         4  486.610989   Prob > F        =    0.0000
    Residual |  9697.35494    20,862  .464833426   R-squared       =    0.1672
-------------+----------------------------------   Adj R-squared   =    0.1670
       Total |  11643.7989    20,866   .55802736   Root MSE        =    .68179

------------------------------------------------------------------------------
       lwage |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         age |   .0709537   .0031403    22.59   0.000     .0647984    .0771089
        educ |   .3089981   .0054571    56.62   0.000     .2983017    .3196944
        age2 |  -.0007883   .0000387   -20.36   0.000    -.0008642   -.0007124
         hsg |  -.2121023   .0115306   -18.39   0.000     -.234703   -.1895015
       _cons |   5.182354   .0614248    84.37   0.000     5.061957    5.302751
------------------------------------------------------------------------------

. test educ hsg //Education consists of these two variables and therefore needs an F-test

 ( 1)  educ = 0
 ( 2)  hsg = 0

       F(  2, 20862) = 1764.64
            Prob > F =    0.0000

. //question 7: 0.3089981-0.2121023 = 0.0968958
. //question 8: (3-1)*0.3089981 = 0.6179962
. 
. //model 4 (question 9+10)
. reg lwage age educ age2 hsg married

      Source |       SS           df       MS      Number of obs   =    20,867
-------------+----------------------------------   F(5, 20861)     =    837.75
       Model |  1947.04904         5  389.409808   Prob > F        =    0.0000
    Residual |  9696.74986    20,861  .464826703   R-squared       =    0.1672
-------------+----------------------------------   Adj R-squared   =    0.1670
       Total |  11643.7989    20,866   .55802736   Root MSE        =    .68178

------------------------------------------------------------------------------
       lwage |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         age |   .0716079   .0031922    22.43   0.000     .0653509    .0778649
        educ |    .309245   .0054613    56.62   0.000     .2985403    .3199496
        age2 |  -.0007957   .0000393   -20.27   0.000    -.0008726   -.0007187
         hsg |  -.2122648   .0115313   -18.41   0.000    -.2348671   -.1896625
     married |  -.0110127   .0096523    -1.14   0.254     -.029932    .0079066
       _cons |   5.173891   .0618705    83.62   0.000      5.05262    5.295162
------------------------------------------------------------------------------

. reg lwage age educ age2 hsg married id

      Source |       SS           df       MS      Number of obs   =    20,867
-------------+----------------------------------   F(6, 20860)     =    698.12
       Model |  1947.11093         6  324.518489   Prob > F        =    0.0000
    Residual |  9696.68797    20,860   .46484602   R-squared       =    0.1672
-------------+----------------------------------   Adj R-squared   =    0.1670
       Total |  11643.7989    20,866   .55802736   Root MSE        =     .6818

------------------------------------------------------------------------------
       lwage |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         age |    .071613   .0031923    22.43   0.000     .0653558    .0778702
        educ |   .3092231   .0054618    56.62   0.000     .2985175    .3199286
        age2 |  -.0007957   .0000393   -20.27   0.000    -.0008727   -.0007187
         hsg |  -.2121717   .0115344   -18.39   0.000    -.2347801   -.1895634
     married |  -.0110105   .0096525    -1.14   0.254    -.0299302    .0079092
          id |   3.76e-12   1.03e-11     0.36   0.715    -1.64e-11    2.39e-11
       _cons |   5.170924   .0624038    82.86   0.000     5.048608    5.293241
------------------------------------------------------------------------------

. //model 5
. xtreg lwage age age2 educ hsg married, fe i(id)

Fixed-effects (within) regression               Number of obs     =     20,867
Group variable: id                              Number of groups  =      6,309

R-sq:                                           Obs per group:
     within  = 0.0779                                         min =          1
     between = 0.0943                                         avg =        3.3
     overall = 0.1011                                         max =         10

                                                F(5,14553)        =     245.83
corr(u_i, Xb)  = -0.2469                        Prob > F          =     0.0000

------------------------------------------------------------------------------
       lwage |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         age |   .0796032   .0051777    15.37   0.000     .0694542    .0897521
        age2 |  -.0006447   .0000633   -10.18   0.000    -.0007688   -.0005205
        educ |   .2607587   .0195761    13.32   0.000      .222387    .2991303
         hsg |  -.3999699   .0294123   -13.60   0.000    -.4576217    -.342318
     married |  -.0338769   .0077285    -4.38   0.000    -.0490257   -.0187281
       _cons |   4.782228   .1053789    45.38   0.000     4.575672    4.988784
-------------+----------------------------------------------------------------
     sigma_u |  .73410866
     sigma_e |  .39043057
         rho |  .77951011   (fraction of variance due to u_i)
------------------------------------------------------------------------------
F test that all u_i=0: F(6308, 14553) = 7.78                 Prob > F = 0.0000

. // model 6 question 12
. xtreg lwage age age2 educ hsg married i.firmsize, fe i(id)

Fixed-effects (within) regression               Number of obs     =     19,396
Group variable: id                              Number of groups  =      5,977

R-sq:                                           Obs per group:
     within  = 0.0913                                         min =          1
     between = 0.1175                                         avg =        3.2
     overall = 0.1253                                         max =         10

                                                F(7,13412)        =     192.50
corr(u_i, Xb)  = -0.2143                        Prob > F          =     0.0000

----------------------------------------------------------------------------------------
                 lwage |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-----------------------+----------------------------------------------------------------
                   age |   .0733007   .0051581    14.21   0.000     .0631901    .0834112
                  age2 |  -.0005739   .0000631    -9.09   0.000    -.0006977   -.0004502
                  educ |   .2334386   .0196318    11.89   0.000     .1949575    .2719197
                   hsg |  -.4022365   .0293923   -13.69   0.000    -.4598497   -.3446234
               married |  -.0317735   .0077135    -4.12   0.000    -.0468931   -.0166539
                       |
              firmsize |
    25 to 200 Workers  |   .1004481   .0133505     7.52   0.000     .0742793    .1266168
More than 200 Workers  |   .1910562    .015755    12.13   0.000     .1601742    .2219382
                       |
                 _cons |   4.881525   .1051787    46.41   0.000      4.67536     5.08769
-----------------------+----------------------------------------------------------------
               sigma_u |  .70268875
               sigma_e |   .3722796
                   rho |  .78083478   (fraction of variance due to u_i)
----------------------------------------------------------------------------------------
F test that all u_i=0: F(5976, 13412) = 7.55                 Prob > F = 0.0000

. /*question 13: If the company until a moment ago had 30 employees and they fired 10 employees - the salaries of existing employees remain the same.
> Therefore the calculation is according to a company of 30
> */
. /*question 15
> Remember we look at the same person over time. The hsg variable already contains
> the possibility that educ = 2 and in addition we see that it is negative and educ positive. 
> Therefore it must be that at least one person completed a degree during the experiment in order for us to get the estimate for educ.
> */
. //question 17
. gen yearuk = year*bornuk 
(357 missing values generated)

. xtreg lwage age age2 educ hsg married yearuk, fe i(id)

Fixed-effects (within) regression               Number of obs     =     20,510
Group variable: id                              Number of groups  =      6,230

R-sq:                                           Obs per group:
     within  = 0.0777                                         min =          1
     between = 0.0008                                         avg =        3.3
     overall = 0.0002                                         max =         10

                                                F(6,14274)        =     200.54
corr(u_i, Xb)  = -0.9970                        Prob > F          =     0.0000

------------------------------------------------------------------------------
       lwage |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         age |   .0906175   .0062222    14.56   0.000     .0784213    .1028138
        age2 |  -.0006469   .0000641   -10.09   0.000    -.0007726   -.0005212
        educ |   .2609151   .0197716    13.20   0.000     .2221602      .29967
         hsg |  -.4049365   .0299439   -13.52   0.000    -.4636304   -.3462425
     married |  -.0342664   .0078212    -4.38   0.000     -.049597   -.0189358
      yearuk |  -.0124973   .0036882    -3.39   0.001    -.0197266   -.0052679
       _cons |   26.04175   6.273344     4.15   0.000     13.74518    38.33832
-------------+----------------------------------------------------------------
     sigma_u |  9.8417508
     sigma_e |  .39180984
         rho |  .99841759   (fraction of variance due to u_i)
------------------------------------------------------------------------------
F test that all u_i=0: F(6229, 14274) = 7.73                 Prob > F = 0.0000

. 
. 
. //question 25
. /*I calculated the normal probability for two packs of cigarettes (and the average values ​​of the other variables) 
> and subtracted the normal probability for one pack of cigarettes (and the average values ​​of the other variables)
> (-0.1253025-0.2926817*0.5208934-0.4430008*0.7845821-0.0074411*12.93583+0.5835045*2) =~ 0.4
> (-0.1253025-0.2926817*0.5208934-0.4430008*0.7845821-0.0074411*12.93583+0.5835045) =~ (-0.1)
> Φ(0.4)-Φ(-0.1) = 0.6554217-0.4601722=0.1952495
> */
. 
. log close                                               // close the log
      name:  <unnamed>
       log:  C:\Users\idank\לימודים\שנה ב\אקונומטריקה\מבחן בית\Final_Exam.log
  log type:  text
 closed on:  19 Feb 2021, 00:54:20
-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
