--------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  C:\Users\idank\לימודים\שנה ב\אקונומטריקה\תרגיל 10\ps10_log.log
  log type:  text
 opened on:  14 Jan 2021, 12:30:49

. 
. 
. /* 
> Idan Keipour and Menachem Sokolik
> 315355537 314696972
> EX10
> */
. 
. use "Fertility", clear                // open a Stata data file"

. des

Contains data from Fertility.dta
  obs:       254,654                          
 vars:             7                          4 May 2016 14:30
 size:     1,782,578                          
--------------------------------------------------------------------------------------------------------------
              storage   display    value
variable name   type    format     label      variable label
--------------------------------------------------------------------------------------------------------------
morekids        byte    %9.0g                 =1 if mom had more than 2 kids
samesex         byte    %9.0g                 =1 if 1st two kids same sex
agem1           byte    %9.0g                 age of mom at census
black           byte    %9.0g                 =1 if mom is black
hispan          byte    %9.0g                 =1 if mom is hispanic
othrace         byte    %9.0g                 =1 if mom is othrace
weeksm1         byte    %9.0g                 moms weeks worked in 1979
--------------------------------------------------------------------------------------------------------------
Sorted by: 

. sum agem1

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
       agem1 |    254,654    30.39327    3.386447         21         35

. sum weeksm1

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
     weeksm1 |    254,654    19.01833    21.86728          0         52

. count if weeksm1 == 0
  120,141

. mean weeksm1 if weeksm1>0

Mean estimation                   Number of obs   =    134,513

--------------------------------------------------------------
             |       Mean   Std. Err.     [95% Conf. Interval]
-------------+------------------------------------------------
     weeksm1 |   36.00466   .0467253      35.91308    36.09624
--------------------------------------------------------------

. count if morekids
  96,912

. count if samesex
  128,745

. reg weeksm1 morekids agem1 black hispan othrace

      Source |       SS           df       MS      Number of obs   =   254,654
-------------+----------------------------------   F(5, 254648)    =   2330.78
       Model |  5328869.45         5  1065773.89   Prob > F        =    0.0000
    Residual |   116440546   254,648  457.260791   R-squared       =    0.0438
-------------+----------------------------------   Adj R-squared   =    0.0437
       Total |   121769415   254,653  478.177816   Root MSE        =    21.384

------------------------------------------------------------------------------
     weeksm1 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    morekids |  -6.230418   .0881296   -70.70   0.000     -6.40315   -6.057687
       agem1 |   .8378841   .0126208    66.39   0.000     .8131476    .8626207
       black |   11.66424   .1921723    60.70   0.000     11.28759    12.04089
      hispan |    .466093   .1793652     2.60   0.009      .114542    .8176439
     othrace |   2.142125   .2030385    10.55   0.000     1.744175    2.540075
       _cons |  -4.834514   .3854049   -12.54   0.000    -5.589898   -4.079131
------------------------------------------------------------------------------

. reg morekids samesex agem1 black hispan othrace

      Source |       SS           df       MS      Number of obs   =   254,654
-------------+----------------------------------   F(5, 254648)    =   1262.09
       Model |  1451.65094         5  290.330189   Prob > F        =    0.0000
    Residual |  58579.1858   254,648  .230039843   R-squared       =    0.0242
-------------+----------------------------------   Adj R-squared   =    0.0242
       Total |  60030.8368   254,653  .235735832   Root MSE        =    .47962

------------------------------------------------------------------------------
    morekids |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
     samesex |   .0680081    .001901    35.77   0.000     .0642821    .0717341
       agem1 |   .0153898   .0002814    54.68   0.000     .0148382    .0159415
       black |   .1005237   .0043058    23.35   0.000     .0920844    .1089629
      hispan |   .1512258   .0040119    37.69   0.000     .1433625    .1590892
     othrace |   .0275069   .0045537     6.04   0.000     .0185817    .0364321
       _cons |  -.1395319   .0086985   -16.04   0.000    -.1565808    -.122483
------------------------------------------------------------------------------

. predict morekids_predict
(option xb assumed; fitted values)

. reg weeksm1 morekids_predict agem1 black hispan othrace , robust

Linear regression                               Number of obs     =    254,654
                                                F(5, 254648)      =    1361.65
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0251
                                                Root MSE          =     21.592

----------------------------------------------------------------------------------
                 |               Robust
         weeksm1 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-----------------+----------------------------------------------------------------
morekids_predict |  -5.821051   1.258449    -4.63   0.000    -8.287577   -3.354526
           agem1 |   .8315975   .0228595    36.38   0.000     .7867934    .8764016
           black |   11.62327   .2347354    49.52   0.000      11.1632    12.08335
          hispan |   .4041803   .2634747     1.53   0.125    -.1122231    .9205837
         othrace |   2.130962   .2132447     9.99   0.000     1.713008    2.548916
           _cons |  -4.791894   .3935775   -12.18   0.000    -5.563295   -4.020492
----------------------------------------------------------------------------------

. ivregress 2sls weeksm1 (morekids=samesex) agem1 black hispan othrace , robust

Instrumental variables (2SLS) regression          Number of obs   =    254,654
                                                  Wald chi2(5)    =    6954.98
                                                  Prob > chi2     =     0.0000
                                                  R-squared       =     0.0437
                                                  Root MSE        =     21.384

------------------------------------------------------------------------------
             |               Robust
     weeksm1 |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    morekids |  -5.821051   1.246386    -4.67   0.000    -8.263923   -3.378179
       agem1 |   .8315975   .0226406    36.73   0.000     .7872228    .8759722
       black |   11.62327   .2317953    50.14   0.000     11.16896    12.07758
      hispan |   .4041802   .2607962     1.55   0.121     -.106971    .9153314
     othrace |   2.130962   .2109857    10.10   0.000     1.717438    2.544486
       _cons |  -4.791894   .3897868   -12.29   0.000    -5.555862   -4.027925
------------------------------------------------------------------------------
Instrumented:  morekids
Instruments:   agem1 black hispan othrace samesex

. 
. 
. 
.  
. log close                                               // close the log
      name:  <unnamed>
       log:  C:\Users\idank\לימודים\שנה ב\אקונומטריקה\תרגיל 10\ps10_log.log
  log type:  text
 closed on:  14 Jan 2021, 12:30:51
--------------------------------------------------------------------------------------------------------------
