----------------------------------------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  C:\Users\idank\לימודים\שנה ב\אקונומטריקה\תרגיל 4\ps4_log.log
  log type:  text
 opened on:  18 Nov 2020, 22:38:15

. 
. 
. /* 
> idan keipour 
> 315355537
> EX4
> */
. 
. use "HPRICES.dta", clear                // open a Stata data file"
file HPRICES.dta not found
r(601);

end of do-file

r(601);

. reg price sqrft bdrms
no variables defined
r(111);

. 

. use "HPRICES.dta", clear

. reg price sqrft

      Source |       SS           df       MS      Number of obs   =       176
-------------+----------------------------------   F(1, 174)       =    291.76
       Model |  1.1745e+12         1  1.1745e+12   Prob > F        =    0.0000
    Residual |  7.0048e+11       174  4.0258e+09   R-squared       =    0.6264
-------------+----------------------------------   Adj R-squared   =    0.6243
       Total |  1.8750e+12       175  1.0714e+10   Root MSE        =     63449

------------------------------------------------------------------------------
       price |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       sqrft |   139.9854   8.195431    17.08   0.000     123.8102    156.1607
       _cons |   12315.18   17979.88     0.68   0.494    -23171.56    47801.93
------------------------------------------------------------------------------

. reg price sqrft bdrms

      Source |       SS           df       MS      Number of obs   =       176
-------------+----------------------------------   F(2, 173)       =    150.87
       Model |  1.1917e+12         2  5.9587e+11   Prob > F        =    0.0000
    Residual |  6.8329e+11       173  3.9497e+09   R-squared       =    0.6356
-------------+----------------------------------   Adj R-squared   =    0.6314
       Total |  1.8750e+12       175  1.0714e+10   Root MSE        =     62846

------------------------------------------------------------------------------
       price |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       sqrft |   129.1306   9.641867    13.39   0.000     110.0998    148.1615
       bdrms |   12780.09   6125.739     2.09   0.038     689.2825     24870.9
       _cons |  -12726.52   21476.41    -0.59   0.554    -55116.04    29663.01
------------------------------------------------------------------------------

. predict price
variable price already defined
r(110);

. predict price bdrms=4 sqrft=1
=exp not allowed
r(101);

. reg price sqrft bdrms

      Source |       SS           df       MS      Number of obs   =       176
-------------+----------------------------------   F(2, 173)       =    150.87
       Model |  1.1917e+12         2  5.9587e+11   Prob > F        =    0.0000
    Residual |  6.8329e+11       173  3.9497e+09   R-squared       =    0.6356
-------------+----------------------------------   Adj R-squared   =    0.6314
       Total |  1.8750e+12       175  1.0714e+10   Root MSE        =     62846

------------------------------------------------------------------------------
       price |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       sqrft |   129.1306   9.641867    13.39   0.000     110.0998    148.1615
       bdrms |   12780.09   6125.739     2.09   0.038     689.2825     24870.9
       _cons |  -12726.52   21476.41    -0.59   0.554    -55116.04    29663.01
------------------------------------------------------------------------------

. predict 140 0
0 invalid name
r(198);

. predict price 140 0
varlist not allowed
r(101);

. predict price
variable price already defined
r(110);

. exit, clear
